
## :white_check_mark: Apply Succeeded (pocket-router-cdk-dev)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/6383)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Refreshing state... [id=arn:aws:ecs:us-east-1:410318598490:cluster/PocketRouter-Dev]
data.aws_sns_topic.backend_notifications: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Reading...
aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF: Refreshing state... [id=a5c5b57c-cfc8-4ea4-9a63-2657550b5bf0:PocketRouter-Dev-ECS]
aws_acm_certificate.application_cdn_certificate_E17B2815: Refreshing state... [id=arn:aws:acm:us-east-1:410318598490:certificate/3dbc7c5d-9879-4759-b8c6-c1d8697278ab]
aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0: Refreshing state... [id=pocketrouter-dev-app]
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Refreshing state... [id=Z070090020188TMHLF10V]
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Reading...
aws_cloudwatch_log_group.app-log-group: Refreshing state... [id=/Backend/PocketRouter-Dev/ecs/app]
data.aws_region.application_pocket_vpc_current_region_7774DA97: Read complete after 0s [id=us-east-1]
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Read complete after 0s [id=4250039221]
aws_s3_bucket.synthetics_synthetics_synthetic_check_artifacts_53DD59E6: Refreshing state... [id=pocket-pocketrouter-dev-synthetic-checks]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Reading...
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Read complete after 0s [id=410318598490]
data.aws_s3_bucket.application_application_load_balancer_log-bucket_417BB177: Reading...
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Reading...
data.aws_sns_topic.backend_notifications: Read complete after 0s [id=arn:aws:sns:us-east-1:410318598490:Backend-Dev-ChatBot]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Reading...
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_assume_66385ECA: Reading...
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_assume_66385ECA: Read complete after 0s [id=2690255455]
data.aws_kms_alias.kms_alias: Reading...
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Read complete after 0s [id=1077804475]
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Reading...
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Reading...
data.aws_s3_bucket.application_application_load_balancer_log-bucket_417BB177: Read complete after 0s [id=pocket-data-items-dev]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Reading...
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.caller: Reading...
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Read complete after 0s [id=410318598490]
data.aws_region.region: Reading...
aws_acm_certificate.application_alb_certificate_93966247: Refreshing state... [id=arn:aws:acm:us-east-1:410318598490:certificate/0aec5c48-b902-4d44-b4e0-9cdcf2954bcb]
data.aws_region.region: Read complete after 0s [id=us-east-1]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Reading...
data.aws_caller_identity.caller: Read complete after 0s [id=410318598490]
aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3: Refreshing state... [id=PocketRouter-Dev-ECSCodeDeployRole]
aws_iam_role.synthetics_synthetic_check_role_A3A5C38B: Refreshing state... [id=pocket-pocketrouter-dev-synthetic-check]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Read complete after 1s [id=/Shared/Vpc]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Reading...
aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA: Refreshing state... [id=PocketRouter-Dev-TaskExecutionRole]
aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED: Refreshing state... [id=PocketRouter-Dev-TaskRole]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Read complete after 0s [id=3898582139]
aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:410318598490:notificationrule/e95300673ad601ae83b45cd789da961e91bcae23]
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Refreshing state... [id=pocketrouter-dev-app]
data.aws_vpc.application_pocket_vpc_22D55D83: Reading...
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Refreshing state... [id=arn:aws:iam::410318598490:policy/PocketRouter-Dev-TaskExecutionRolePolicy]
aws_route53_record.application_cdn_certificate_certificate_record_F3EF0357: Refreshing state... [id=Z070090020188TMHLF10V__b640b288474236fc5af81f1c96dce3da.pocket-router.getpocket.dev._CNAME]
aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725: Refreshing state... [id=PocketRouter-Dev-ECSCodeDeployRole-20240105014324582800000007]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Refreshing state... [id=Z070090020188TMHLF10V__de2a34c590c057c39e5e2e6c71ca9546.direct.pocket-router.getpocket.dev._CNAME]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Refreshing state... [id=PocketRouter-Dev-TaskExecutionRole-20240105014324717700000008]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Refreshing state... [id=PocketRouter-Dev]
aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB: Refreshing state... [id=router-dev-uptime-0]
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_access_4C83FECF: Reading...
aws_s3_bucket_lifecycle_configuration.synthetics_synthetics_synthetic_check_artifacts_lifecycle_5A7B9150: Refreshing state... [id=pocket-pocketrouter-dev-synthetic-checks]
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_access_4C83FECF: Read complete after 0s [id=4035653370]
aws_iam_policy.synthetics_synthetics_synthetic_check_access_policy_9A7D8849: Refreshing state... [id=arn:aws:iam::410318598490:policy/pocket-pocketrouter-dev-synthetic-check-access]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Refreshing state... [id=PocketRouter-Dev-TaskExecutionRole-2024010501432485080000000a]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Read complete after 1s [id=ZCSIDA846KWLN]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Refreshing state... [id=ZCSIDA846KWLN_pocket-router.getpocket.dev_NS]
local_file.application_ecs_service_appspec_94386B9C: Refreshing state... [id=2680826a8faf1dbc9754c2607d913e295968c8b9]
aws_acm_certificate_validation.application_cdn_certificate_certificate_validation_F216BBC7: Refreshing state... [id=2024-01-05 01:44:13.203 +0000 UTC]
aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195: Refreshing state... [id=2024-01-05 01:44:10.545 +0000 UTC]
aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_uptime_0_3A56DFC7: Refreshing state... [id=router-dev-uptime-0]
aws_iam_role_policy_attachment.synthetics_synthetics_synthetic_check_access_attach_BC7F9559: Refreshing state... [id=pocket-pocketrouter-dev-synthetic-check-2024010501434013390000000d]
data.aws_vpc.application_pocket_vpc_22D55D83: Read complete after 0s [id=vpc-012481e83ffa5e152]
aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:targetgroup/ROUTER20240105014324080800000005/88b86fb85a008b7f]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Reading...
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Reading...
aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:targetgroup/ROUTER20240105014323950500000003/aeea2f364460de0c]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Reading...
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Reading...
aws_security_group.application_application_load_balancer_alb_security_group_7B45D070: Refreshing state... [id=sg-05274ac3c6cc1eaca]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Read complete after 0s [id=us-east-1]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Read complete after 0s [id=us-east-1]
aws_alb.application_application_load_balancer_alb_05EA9801: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:loadbalancer/app/ROUTER2024010501432622660000000b/7393344950735cde]
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Refreshing state... [id=sg-0b100f8443d31a178]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Read complete after 0s [id=us-east-1]
aws_alb_listener.application_listener_https_D31CB055: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener/app/ROUTER2024010501432622660000000b/7393344950735cde/0be38694c26628f4]
aws_alb_listener.application_listener_http_D74EC0ED: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener/app/ROUTER2024010501432622660000000b/7393344950735cde/99dad3bfc6400ce8]
aws_cloudwatch_metric_alarm.application_alarm-httpresponsetime_9124C30A: Refreshing state... [id=PocketRouter-Dev-Alarm-HTTPResponseTime]
aws_route53_record.application_alb_record_8EA9D3F9: Refreshing state... [id=Z070090020188TMHLF10V_direct.pocket-router.getpocket.dev_A_1]
aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0: Refreshing state... [id=PocketRouter-Dev-Alarm-HTTPTarget5xxErrorRate]
aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener-rule/app/ROUTER2024010501432622660000000b/7393344950735cde/0be38694c26628f4/aca1309e467c770d]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Refreshing state... [id=EB81TMAWC5GJ1]
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Refreshing state... [id=arn:aws:ecs:us-east-1:410318598490:service/PocketRouter-Dev/PocketRouter-Dev]
aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED: Refreshing state... [id=PocketRouter-Dev]
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Refreshing state... [id=service/PocketRouter-Dev/PocketRouter-Dev]
aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247: Refreshing state... [id=ff3b43f1-93fc-42c7-8440-dd238cb860e5]
aws_route53_record.application_cdn_record_B2BBECBB: Refreshing state... [id=Z070090020188TMHLF10V_pocket-router.getpocket.dev_A_2]
aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2: Refreshing state... [id=PocketRouter-Dev-ScaleOutPolicy]
aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511: Refreshing state... [id=PocketRouter-Dev-ScaleInPolicy]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0: Refreshing state... [id=PocketRouter-Dev Service High CPU]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1: Refreshing state... [id=PocketRouter-Dev Service Low CPU]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:410318598490:task-definition/PocketRouter-Dev:7" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:410318598490:task-definition/PocketRouter-Dev" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                        # (1 unchanged element hidden)
                        {
                            name  = "PORT"
                            value = "4000"
                        },
                      ~ {
                            name  = "RELEASE_SHA"
                          ~ value = "13c2a155f2434dad056e4a235faf75c09f591c0a" -> "7b9b349abac897923a5cec7afc08bc8c063f2ad2"
                        },
                    ]
                    name                   = "app"
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "PocketRouter-Dev" -> (known after apply)
      ~ revision                 = 7 -> (known after apply)
        tags                     = {
            "environment" = "Dev"
            "service"     = "PocketRouter"
        }
        # (9 unchanged attributes hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destroying... [id=PocketRouter-Dev]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destruction complete after 1s
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creating...
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creation complete after 0s [id=PocketRouter-Dev]
local_file.application_ecs_service_appspec_94386B9C: Creating...
local_file.application_ecs_service_appspec_94386B9C: Creation complete after 0s [id=20375b8105e7147c6215719e033de55f72de6383]

Apply complete! Resources: 2 added, 0 changed, 1 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"8374de34-fea7-4936-bf3e-0a0257dea5e0","JobName":"pocket-router_infrastructure_apply_dev","PRNumber":41,"Program":"tfcmt","SHA1":"7b9b349abac897923a5cec7afc08bc8c063f2ad2","Target":"pocket-router-cdk-dev","Vars":{}} -->